[
    {
        "text": "DoctorLogic has been amazing to work with while creating our new website. Customer service has been exceptional and they are extremely helpful in explaining each step to those of us who may not be quite as tech savvy. We have monthly phone calls with our account manager to keep us updated on our site and what we can do to maximize growth. I highly recommend DoctorLogic!",
        "author": "Ashley Barnes",
        "link-label": "khoobehi.com",
        "link": "https://khoobehi.com/"
    },
    {
        "text": "DoctorLogic is the best! Working with DoctorLogic: The team at DoctorLogic is top notch. Everyone I have worked with has delivered beyond my expectations. Most companies have great sales people but then after you sign-up it becomes a challenge to get things done. This is not the case with DoctorLogic. Their implementation team is very efficient and delivered our websites on time and without any major surprises. They have their launch plan down to a science and they know what works.  The content they created is professional and accurate. The relationship doesn’t end once the website is done. The account management team is committed to our practice’s success and continuously provide insights and make improvements. If we need a quick change or update to the website, their customer support team will get it done right away. The entire team is well informed and executes with excellence. The Product: DoctorLogic is more than a website development company. They are an extension of our digital marketing efforts. They build and maintain websites that are built to perform well in search results, but more importantly they are designed to provide potential patients all the information they need to convert right then and there. DoctorLogic is a true partner. The dashboard or back end of the website makes it easy to see how we are doing with a few simple clicks. The data provided is relevant and instantly available. Their tool automatically pulls in reviews from across the internet where we can easily post them to our website. When it comes to before and after galleries, we used to have to type out what we wanted in an email and send it off to our web designer and wait to have it added to our website. Now we can upload the pictures directly to site and have it live on the site in a matter minutes. The ability to listen to patient calls has been a great tool for our team. Reviewing calls to see how our staff handles them makes each call a coaching opportunity which leads to a better patient experience. Performance: What matters most are the results!  Our website pages are ranking higher and higher each month in organic search results. In fact, content from several of our services and procedures are delivered in snippets directly in google search results. This speaks to the quality of the content they have helped us create. Our website visitors are steadily increasing, and our conversion rates are better than we’ve seen historically.",
        "author": "Preston Huffington",
        "link-label": "drsnyder.com",
        "link": "https://drsnyder.com/"
    },
    {
        "text": "Switching to Doctorlogic was the best decision we have ever made.  The keyword tagging options for photographs has increased our visibility immensely.   We love the clean look of their designs and the responsiveness of software updates, etc.  The staff are always pleasant and quick to address any questions or concerns.  We also love the ability to make on page edits.  We no longer have to wait on a third party to make simple changes.",
        "author": "Krista Donahue",
        "link-label": "petroffcenter.com",
        "link": "https://petroffcenter.com/"
    },
    {
        "text": "I have tried many different website design and development companies and none compare to DoctorLogic. The patented technology they employ to ensure your web presence is optimized coupled with their gorgeous designs, excellent back-end technology and detailed analytics are the business side and they are out of this world. But let's not forget about the human side of things that makes this company blow the competition out of the water. Working with Grace and Mary has been instrumental in getting my three websites off the ground, as they have helped me in every step of the way. DoctorLogic is amazing, and their employees are insanely helpful.",
        "author": "Masoud Saman",
        "link-label": "planofacedoc.com",
        "link": "https://planofacedoc.com/"
    },
    {
        "text": "Nice company to work with. We had a ton of edits to our website, and Doctor Logic implemented each one without complaint, plus they carefully explained how to navigate our dashboard and were more than willing to make corrections or additions.  Big improvement over what we had previously.  Recommend you give them a try--don't think you will be disappointed.",
        "author": "Dental Assistant",
        "link-label": "doctorlogic.com",
        "link": "https://doctorlogic.com/"
    },
    {
        "text": "My experience with the DoctorLogic team, specifically that of Christopher Hiltz and John Vakidis, has been nothing short of outstanding.  This is the third time in my career as a plastic surgeon that I have launched a new site and I did so with great trepidation because I felt I was starting over.  I just wasn't getting the results that I wanted from my former site.  But this has been the easiest and most seamless process to date.  The team is outstanding and the customer service is second to none.  This platform is everything I was searching for and it is very easy to navigate.  The platform gives you complete control of your content, photo gallery, analytics, phone call tracking, and monitoring calls and leads.  It also tracks and records how calls are handled in the practice.  I am able to download new patient photos at my convenience and add personal stories unique to each case I present on the site.  Partnering with DoctorLogic has been the best marketing decision I have made to date and I cannot thank you enough for your professionalism, excellent customer service and state-of-the art platform and design!",
        "author": "George Kouris",
        "link-label": "drkouris.com",
        "link": "https://drkouris.com/"
    },
    {
        "text": "DoctorLogic has created a magnificent website for our small business. Very easy to work with and the support is outstanding. Highly recommend.",
        "author": "Anna Leigh Phillips",
        "link-label": "garlandoralsurgery.com",
        "link": "https://garlandoralsurgery.com/"
    },
    {
        "text": "I have really enjoyed working with the Doctor Logic team on our website and the SEO strategy. First of all, the are very responsive. Their knowledge of procedures and processes really help in creating new pages to reflect our growing Medical Spa. We rebranded this year and they provided several options for us to consider and they have been really great in helping us integrate our brand into their template system. They are really on top on new technology and helping us make the website work in creating conversions. Account service is top notch.",
        "author": "Ken Maxwell",
        "link-label": "beyondbeautifultexas.com",
        "link": "https://beyondbeautifultexas.com/"
    },
    {
        "text": "DoctorLogic helped us build a great website and has increased our conversion rate from website visitors. We've been very please with their support as well.",
        "author": "Lorie Dunn",
        "link-label": "startsmiling.com",
        "link": "https://startsmiling.com/"
    },
    {
        "text": "As a professional marketer and dental marketing strategy consultant, I've concluded that DoctorLogic's website platform is currently the best overall website option available. While it lacks some customization flexibility for experienced SEO/PPC consultants, for a typical dentist looking for turnkey results it's outstanding. Depending how you wish to position your practice, DL developers are very good at translating that into effective visuals and efficient page layouts. If you can generate reviews regularly (I'd recommend BirdEye if you can't) and invest a bit of time each month posting before/after photos/cases, the platform over time will rank you progressively higher in Google search without requiring you to become a blogger to generate fresh content. Organic traffic for a client who already ranked #1 on Google organic and Google local for cosmetic dentistry has increased more than 70% in the year since converting them from a Wordpress site, showing me the SEO and authority building power of the DoctorLogic platform. Search ranks have also increased on key categories where they weren't #1. Customer service has been very responsive and timely for my requests, and development folks have listened to and placed in the IT queue recommendations for changes to areas that will allow more customization by the client. So if you want potential patients to have the best first impression of your practice, check DoctorLogic out!",
        "author": "Dave Swift",
        "link-label": "dallascosmeticdentist.us",
        "link": "https://dallascosmeticdentist.us/"
    },
    {
        "text": "Outstanding results and team. Best web services so far.",
        "author": "Stephen Wilmarth",
        "link-label": "wilmartheye.com",
        "link": "https://wilmartheye.com/"
    },
    {
        "text": "I have been working with DoctorLogic for almost a year now.  I met with them at the AACD meeting in 2018, and I was very impressed with their technology involved with websites.  The entire process of designing a new site along with the attention to detail after the site was built has been refreshing.  My site continues to be strong in dental searches and I would highly recommend working with this fine group of people.",
        "author": "Troy Gombert",
        "link-label": "myextraordinarysmile.com",
        "link": "https://myextraordinarysmile.com/"
    },
    {
        "text": "I have been working with DoctorLogic nearly 6 months now to get my new(est) website launched.  This is always a painful prospect due to the scope and amount of effort that goes into such an important project. This team (currently I am working with Missy, who is great), is professional, responsive, and knowledgeable.  This professionalism has taken a load off of my mind because I have had the misfortune of dealing with webmasters in the past who talk a great game and produce a clunky site that manages to be invisible to SEO.  To make matters worse, these fly-by-night outfits never respond after they are paid. You won't have to worry about these issues with DoctorLogic. There are several teams dedicated to each phase of implementation and hand-offs are smooth.  This has allowed me to focus my time an energy on being a doctor.  I rest assured that the work they do will be right, and any adjustments I want will be taken care of. DoctorLogic has my full confidence and I have no reservations about giving them my highest review and confidence.",
        "author": "Scott E. Kasden, M.D., F.A.C.S.",
        "link-label": "txplasticsurgeon.com",
        "link": "https://txplasticsurgeon.com/"
    },
    {
        "text": "They are awesome  Very helpful with great turn around time.",
        "author": "Jessica Churchwell",
        "link-label": "southeasternretinaspecialists.com",
        "link": "https://southeasternretinaspecialists.com/"
    },
    {
        "text": "DoctorLogic goes above and beyond every time!  On behalf of myself and Dr. Nana Mizuguchi, DoctorLogic has been a pleasure to work with. From building our website from the ground up with images and content to helping us utilize SEO and PPC to the utmost potential. Every task we have requested has been completed quickly and efficiently. Grace Fatseas with DoctorLogic has been amazing in educating us about our website and advising us based on our analytics. She has provided us with a lot of education about our website and had so many great suggestions with continuing to add content. We are so happy to work with DoctorLogic!",
        "author": "Maggie Liter",
        "link-label": "nanamd.com",
        "link": "https://nanamd.com/"
    },
    {
        "text": "My office has been a client with DoctorLogic for almost 2 yrs. I switched from a well known medical/dental website builder/hoster who I was with for 7 yrs. I found that DoctorLogic has a significantly better attention to detail and has a much better understanding of “the ways of the web”. But also how they have helped me and my staff understand where to place emphasis on our web site to keep current with the changes of Google. Also with my prior web builder, every time Google had a major change, we had to do a major rebuild at significant cost. It just seemed that every time I turned around they had a reason to charge for additional work. With DoctorLogic I have had none of that happen. Their vast knowledge of web building and SEO is really apparent. But this is all for nothing if you do not have results. DoctorLogic has me on the first page of Google in most web searches pertaining to dentistry in a very large metropolitan area. Not only has our referrals increased from the web but also the quality of the patients have been outstanding. I can recommend DoctorLogic to any medical or dental office looking for a comprehensive approach to their web site without any reservations.",
        "author": "Dr. Ron Bosher, D.D.S., F.A.G.D.",
        "link-label": "parkerwestdental.com/",
        "link": "https://parkerwestdental.com/"
    },
    {
        "text": "DoctorLogic has been a wonderful partner to work with for our company's website.  My favorite aspect of DoctorLogic is their excellent customer service!  Everyone we have worked with has been friendly and accommodating; their turnaround time on requests is super quick.  DoctorLogic helps guide us in the right direction when making decisions in order to help us reach our website's optimal performance.  Their knowledge and tracking of SEO has been very beneficial.  They are constantly adding new and exciting features to their service line which helps keep are website up-to-date with the latest trends.  Thank you, DoctorLogic!",
        "author": "Amanda Nelson",
        "link-label": "villagehealthpartners.com",
        "link": " https://villagehealthpartners.com/"
    },
    {
        "text": "I have referred several clients and all have been absolutely thrilled with their website and especially their SEO results.  Highly recommend DoctorLogic.",
        "author": "Julie Davis",
        "link-label": "pfpsjax.com",
        "link": "https://pfpsjax.com/"
    },
    {
        "text": "Each individual with whom we have worked has brought an expertise and willingness to spend whatever time needed so that the website reflects our business. We highly recommend DoctorLogic to Plastic Surgeons who want to take their business to the next level.",
        "author": "Shelia Sorensen",
        "link-label": "deansorensenmd.com",
        "link": "https://deansorensenmd.com/"
    },
    {
        "text": "DoctorLogic has made our online appearance not only more aesthetically pleasing but has drastically increased our functionality. In the digital world we live in your website is the first window to your practice. It's safe to say when people look into our digital window they like what they see!",
        "author": "Camelia Cooper, D.D.S.",
        "link-label": "sweettoothdentalloft.com",
        "link": "https://sweettoothdentalloft.com/"
    },
    {
        "text": "I am extremely pleased at the website Carson Jones and his team at DoctorLogic produced for me. Having done this a few times before, I know how time intensive it can be. Everyone at DoctorLogic made it easy and with little effort on my part, once they listened to my needs and understood my objectives. I look forward to working with them to develop my practice.",
        "author": "Dr. Karol Gutowski",
        "link-label": "drgutowski.com",
        "link": "https://drgutowski.com/"
    },
    {
        "text": "The creative staff at DoctorLogic has taken my website to new heights. The stunning graphics and video have given our website a sophisticated look and feel. If you're looking to set yourself apart from the competition with your website I highly recommend the doctor, DoctorLogic!",
        "author": "Dr. Earl Stephenson",
        "link-label": "primacenter.com",
        "link": "https://primacenter.com/"
    },
    {
        "text": "DoctorLogic has been my secret weapon in the battle to the top of Google search. In less than a year I went from page three to the top of page one. DoctorLogic empowers my staff to continually update and add content to our site, thereby growing both our content and our rank position.",
        "author": "Dr. Christopher Khorsandi",
        "link-label": "vipplasticsurgery.com/",
        "link": "https://vipplasticsurgery.com/"
    }
]