[
  {
    "name": "DoctorLogic Team",
    "title": "Building Better Websites",
    "img": "/img/people/doctorlogic.jpg",
    "desc": "DoctorLogic helps practices grow by providing the most advanced digital marketing strategies through web development!"
  },
  {
    "name": "Andre Riley",
    "title": "VP of Sales and Marketing",
    "img": "/img/people/andreriley.jpg",
    "desc": "For over 10 years, Andre has been helping small & medium-sized businesses grow their revenue through online marketing."
  },
  {
    "name": "Kristy Theis",
    "title": "Director of Content",
    "img": "/img/people/kristytheis1.jpg",
    "desc": "Kristy leads our team of talented medical writers, inspiring informative and effective content creation through passion and experience."
  },
  {
    "name": "Justin Haber",
    "title": "VP, Client Services",
    "img": "/img/people/justinhaber.jpg",
    "desc": "Justin oversees the amazing team that makes it happen, which is gathering what is needed to assemble, build, and launch gorgeous websites both our clients and the search engines love!"
  },
  {
    "name": "Chris Desrochers",
    "title": "VP, Product Strategy",
    "img": "/img/people/chrisdesrochers.jpg",
    "desc": "Chris oversees product strategy for DoctorLogic. He helps craft our platform to perform for Google, patients, and doctors alike. He's got a knack for analogies and solving hard technical challenges."
  },
  {
    "name": "John Vakidis",
    "title": "Regional Account Manager",
    "img": "/img/people/johnvakidis.jpg",
    "desc": "John specializes in helping practices learn more about online marketing and how they can increase their patient volume."
  },
  {
    "name": "Julie Davis",
    "title": "Healthcare Consultant",
    "img": "/img/people/juliedavis.jpg",
    "desc": "Julie has over 20 years experience of helping doctors create and maintain wealth by solving practice operational problems, overcoming reimbursement challenges and creating alternative revenues."
  },
  {
    "name": "Mary Robb",
    "title": "Regional Account Manager",
    "img": "/img/people/maryrobb.jpg",
    "desc": "Mary is passionate about helping doctors grow their practice through digital marketing."
  },
  {
    "name": "Kaitlin Waits",
    "title": "Senior Regional Account Manager",
    "img": "/img/people/kaitlinwaits.jpg",
    "desc": "For years, Kaitlin has consultatively helped businesses increase revenue through successful digital marketing strategies."
  },
  {
    "name": "Sydnie Summers-Schroeder",
    "title": "Implementation Team Lead",
    "img": "/img/people/sydniesummers.jpg",
    "desc": "Sydnie leads the amazing team that makes it happen, which is gathering what is needed to assemble, build, and launch gorgeous websites both our clients and the search engines love!"
  },
  {
    "name": "Kandace Cortez",
    "title": "VP, Client Success",
    "img": "/img/people/kandacecortez.jpg",
    "desc": "Kandace leads our Client Success team ensuring that our customers get the most out of their websites and have a wonderful experience with DoctorLogic."
  },
  {
    "name": "Matt Sparks",
    "title": "UI / UX Director",
    "img": "/img/people/mattsparks.jpg",
    "desc": "Matt leads our UI/UX Team creating modern, intuitive and captivating websites and tools."
  },
  {
    "name": "Keisha Dunstan",
    "title": "Marketing Director",
    "img": "/img/people/keishadunstan.jpg",
    "desc": "As the leader of the DoctorLogic Marketing team, Keisha believes \"Marketing is Life and Life is Marketing.\" She's a firm believer in everything in life involves the process of marketing and adores talking about the science and beauty of digital campaigns."
  },
  {
    "name": "Janelle Amos",
    "title": "Marketing Manager, Demand Generation",
    "img": "/img/people/janelleamos.jpg",
    "desc": "Janelle brings the marketing strategy to life. Passionate about all things marketing, Janelle specializes in delivering data-driven insights, results, and recommendations for digital and demand generation channels."
  },
  {
    "name": "Brittany Pinder",
    "title": "Sales and Marketing Coordinator",
    "img": "/img/people/brittanypinder.jpg",
    "desc": "While interfacing with cross functional teams, Brittany supports the execution of marketing initiatives from inception through the lifecycle of DoctorLogic’s overall marketing strategy."
  }
]
